name = input("Как тебя зовут? ")
city = input("В каком городе ты живешь? ")
weather = input("Какая у тебя сейчас погода?(солнечная/пасмурная/дождливая) ")
sleepTime = input("Как думаешь, сколько часов ты примерно спала? ")

print('Доброго времени суток, {}. Теперь я знаю, что город в котором бы живёшь это {}.'.format(name, city))
print('Ну а погода у тебя {}.Думаю она всё же лучше моей, ведь я живу в Питере'.format(weather))
print('Смотрю ты спала сегодня {} часа(ов), надеюсь тебе хорошо спалось :)'.format(sleepTime))