def fact(x):
    factor = 1
    for i in range(1, x + 1):
        factor *= i
    yield factor


n = int(input("Введите n (факториал какого числа вы хотите получить): "))
for el in fact(n):
    print(el)


# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция должна вызываться следующим образом:for el in fact(n).
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые n чисел, начиная с1!идоn!.
# Подсказка: факториал числа n — произведение чисел от 1 до n.
# Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.