def my_func():
    arg1 = int(input("Введите 1й аргумент: "))
    arg2 = int(input("Введите 2й аргумент: "))
    arg3 = int(input("Введите 3й аргумент: "))
    sum_arg = arg1 + arg2 + arg3 - min(arg1, arg2, arg3)
    return print(f"Сумма наибольших двух равна {sum_arg}")


my_func()

# Реализовать функцию my_func(), которая принимает три позиционных аргумента, и возвращает сумму наибольших двух аргументов.
