def my_func(x, y):
    print(f"Возведение в степень с использованием ** : {x ** y}")
    exp_alt = 1
    result = 0
    while y > 0:
        exp_alt *= x
        y -= 1
    result = 1 / exp_alt
    if y < 0:
        print('Альтернативное возведение в степень : ', result)
    else:
        print('Альтернативное возведение в степень : ', exp_alt)
    return


exp_1 = int(input("Введите действительное положительное число: "))
exp_2 = int(input("Введите целое отрицательное число: "))
my_func(exp_1, exp_2)

"""
n = int(input('num? '))
p = int(input('pow? '))
r = 1
while p > 0:
    r *= n
    p -= 1
"""

#  Программа принимает действительное положительное число x и целое отрицательное число y.
#  Необходимо выполнить возведение числа x в степень y.
#  Задание необходимо реализовать в виде функции my_func(x, y).
#  При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.