def sum_list(user_list):
    for i in user_list:
        new.append(int(i))
    return sum(new)


new = []
s = 0
while True:
    my_list = input("Введите несколько чисел через пробел, или для выхода напишите 'q': ").split()
    if my_list == 'q':
        print('Выполнен выход')
        break

    s += sum_list(my_list)
    print(new)
    print('Сумма = ', s)


#  Программа запрашивает у пользователя строку чисел, разделенных пробелом.
#  При нажатии Enter должна выводиться сумма чисел.
#  Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
#  Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
#  Но если вместо числа вводится специальный символ, выполнение программы завершается.
#  Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу