month = int(input("Введите номер месяца целым числом - "))
winter = [12, 1, 2]
spring = [3, 4, 5]
summer = [6, 7, 8]
authom = [9, 10, 11]

if month in winter:
    print("Это месяц зимы((( обычно это холодновато")
elif month in spring:
    print("Это месяц весны, птички с юга прилетают, цветочки распусгаются")
elif month in summer:
    print("Это месяц лета!!!!)))) - ЛЯПОТАААААА")
elif month in authom:
    print("Это месяц осени, желтая личта и всё такое")
else:
    print("Думаю вы не правильно ввели месяц (если что их всего 12), попробуйте ещё раз")


# 3. Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить к какому времени года относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.
