"""можно воспользоваться как встроенной функцией, так не встроенной(int_func())"""


def int_func(x):
    number = int(ord(x[0]) - 32)
    new_word = chr(number) + x[1:]
    return new_word


text = str(input("Введите слово: "))
choice = str(input("Вы хотите воспользоваться встроенной функцией (нет - будет написаннная мной)? "))
if choice == "да":
    print(text.title())
elif choice == "нет":
    print(int_func(text))
else:
    print("Ответом может быть да или нет. Попробуйте снова :) ")

#  Реализовать функцию int_func(), принимающую слово из маленьких латинских букв и возвращающую его же,
#  но с прописной первой буквой.
#  Например, print(int_func(‘text’)) -> Text.
# Продолжить работу над заданием. В программу должна попадать строка из слов, разделенных пробелом.
# Каждое слово состоит из латинских букв в нижнем регистре. Сделать вывод исходной строки,
# но каждое слово должно начинаться с заглавной буквы. Необходимо использовать написанную ранее функцию int_func().
