def divide(var_1, var_2):
    return var_1 / var_2


a = int(input("Напишите делимое - "))
b = int(input("Напишите делитель - "))

try:
    answer = str(input("Вы хотите получить ответ с остатком? (да или нет) "))
    yes = f"Результатом деления с остатком является {divide(a, b)}"
    no = f"Результатом деления без остатка является {round(divide(a, b))}"
    print(yes) if answer == "да" or answer == "Да" else print(no)
except ZeroDivisionError:
    print("На ноль делить нельзя")

#  Реализовать функцию, принимающую два числа (позиционные аргументы) и выполняющую их деление.
#  Числа запрашивать у пользователя, предусмотреть обработку ситуации деления на ноль.
