from itertools import count, cycle

numbers = []
c = 0

for number in count(3):
    if number > 10:
        break
    else:
        numbers.append(number)  # делаем список добавляя туда значение итератора
print(numbers)

for repeat in cycle(numbers):
    if c > 4:  # завершаем если количество повторений пять
        break
    print(repeat)
    c += 1

#  Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным.
# Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.