def data_user(d1, d2, d3, d4, d5, d6):
    print(f"Данные о пользователе: {name}, {surname}, {bithday}, {city}, {email}, {phone}")


name = input("Имя - ")
surname = input("Фамилия - ")
bithday = input("Дата рождения (формата дд.мм.гг) - ")
city = input("Город проживания - ")
email = input("Еmail - ")
phone = input("Телефон - ")

data_user(d1=name, d2=surname, d3=bithday, d4=city, d5=email, d6=phone)

#  2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
#  имя, фамилия, год рождения, город проживания, email, телефон.
#  Функция должна принимать параметры как именованные аргументы.
#  Реализовать вывод данных о пользователе одной строкой.
