from sys import argv


def wage():
    pay = (int(argv[1]) * int(argv[2])) + int(argv[3])
    return print(pay)


try:
    argv[1] = int(argv[1])
    argv[2] = int(argv[2])
    argv[3] = int(argv[3])
except ValueError:
    print("Для расчета зп нужно вводить только числа")
wage()

#  Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
#  В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия.
#  Для выполнения расчета для конкретных значений необходимо запускать скрипт с параметрами.
