import time


class TrafficLight:
    color = []

    def __init__(self):
        self.__color = ['red', 'yellow', 'green']

    def running(self):
        while True:
            print(f"\033[31m {self.__color[0]}")
            time.sleep(7)
            print(f"\033[33m {self.__color[1]}")
            time.sleep(2)
            print(f"\033[32m {self.__color[2]}")
            time.sleep(7)
            print(f"\033[33m {self.__color[1]}")
            time.sleep(2)


go_traffic = TrafficLight()
go_traffic.running()

# 1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый, зел.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего (зеленый)
# — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке (кр, жел, зел).
# Проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее сообщение и
# завершать скрипт.