my_list = [7, 5, 3, 3, 2]
print(f"То как изначально выглядит наш список {my_list}")
user_n = int(input("Введите целое число - "))

for p in range(len(my_list)):
    if my_list[p] == user_n:
        my_list.insert(p + 1, user_n)
        break
    elif my_list[0] < user_n:
        my_list.insert(0, user_n)
        break
    elif my_list[-1] > user_n:
        my_list.append(user_n)
        break
    elif my_list[p] > user_n and my_list[p + 1] < user_n:
        my_list.insert(p + 1, user_n)
        break

print(f"После добавления список выглядит следующим образом {my_list}")


#  5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел.
#  У пользователя необходимо запрашивать новый элемент рейтинга.
#  Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
