print("Сейчас потребудется ввести 5 эл-в нашего будущего списка, следуйте инстукциям...")
list_1 = int(input("Введите целое положительное число: "))
list_2 = str(input("Напишите слово или предложение: "))
list_3 = float(input("Введите число с остатком (напр: 7.54): "))
list_4 = bool(input("Напишите True или False: "))
list_5 = list(input("Напишите слово/цифру имеющую два и более элементов: "))

user_list = [list_1, list_2, list_3, list_4, list_5]
print(f'\nУ нас получился вот такой список - {user_list}')

user_list.pop(0)
user_list.pop(0)
user_list.insert(0, list_1)
user_list.insert(0, list_2)
user_list.pop(2)
user_list.pop(2)
user_list.insert(2, list_3)
user_list.insert(2, list_4)
print(f"Далее делаем обмен соседних эл-в - {user_list}")

#2. Для списка реализовать обмен значений соседних элементов,
# т.е. Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().